
################################加減乘除餘數 測試##############################################
#取商數
#取餘數

#-*- coding: utf-8 -*-　　
#使用 utf-8 編碼
#-*- coding: cp950 -*-　
#使用 Big5 編碼（windows 下使用）
a = 12
b = 3
c = a / b                              # a 除以 b 的商數
d = a % b                              # a 除以 b 的餘數 整除為0
#print("a = ", a, " and b =", b)
#print("a / b 的商數 = ", c ) # 商數
#print("a / b 的餘數= ", d,"(若為0，表示可整除)")

################################加減乘除餘數 測試##############################################
#取餘數
n=4
e = n % 2   #取餘數 #餘數為0
print(e)

################################加減乘除餘數 測試##############################################
#取餘數    #再加 == 作為值的判斷
n=4
e = n % 2 == 1   #取餘數 #餘數為0 #不等於1 #不成立時 false
print(e)

################################加減乘除餘數 測試##############################################