
################################加減乘除餘數 測試##############################################
#取商數
#取餘數

#-*- coding: utf-8 -*-　　
#使用 utf-8 編碼
#-*- coding: cp950 -*-　
#使用 Big5 編碼（windows 下使用）
a = 12
b = 3
c = a / b                              # a 除以 b 的商數
d = a % b                              # a 除以 b 的餘數 整除為0
#print("a = ", a, " and b =", b)
#print("a / b 的商數 = ", c ) # 商數
#print("a / b 的餘數= ", d,"(若為0，表示可整除)")

################################加減乘除餘數 測試##############################################
#取餘數
n=4
e = n % 2   #取餘數 #餘數為0
print(e)

################################加減乘除餘數 測試##############################################
#取餘數    #再加 == 作為值的判斷
n=4
e = n % 2 == 1   #取餘數 #餘數為0 #不等於1 #不成立時 false
print(e)

################################加減乘除餘數 測試##############################################

################################加減乘除餘數 測試##############################################
#取餘數    #再加 == 作為值的判斷
n=4
e = n % 2 == 1   #取餘數 #餘數為0 #不等於1 #不成立時 false
print(e)

################################加減乘除餘數 測試##############################################

#使用Pycharm中版本控制（Git）的正确姿势
#https://blog.csdn.net/qq_38604355/article/details/105483794?utm_medium=distribute.pc_relevant.none-task-blog-BlogCommendFromMachineLearnPai2-4.nonecase&depth_1-utm_source=distribut
#前往 VCS → VCS Operations Popup… → Commit…      #提交更改檔案
#前往 VCS，选择 Git，然后选择 Resolve conflicts…    #比較檔案的不同 #也可以直接點選檔案比較不同

#123456789789789

#https://www.cnblogs.com/ailiailan/p/11804163.html
#git教學02